Revit 2024 API
Gradient.GradientNoiseSize Property
 The property labeled "Size" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string GradientNoiseSize { get; }
Visual Basic
Public Shared ReadOnly Property GradientNoiseSize As String
	Get
Visual C++
public:
static property String^ GradientNoiseSize {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".
See Also
Gradient Class
Autodesk.Revit.DB.Visual Namespace